Revit 2024 API
PlanTopologySet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual PlanTopologySetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As PlanTopologySetIterator
Visual C++
public:
virtual PlanTopologySetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
PlanTopologySet Class
Autodesk.Revit.DB Namespace